// lib/auxiliaires/donnees_statiques.dart

/// Classe utilitaire pour fournir des données statiques de l'application,
/// comme le texte des duas, les informations, et les listes d'images du Coran.
class DonneesStatiques {

  /// Retourne la liste des chemins d'images pour un ID de Coran donné.
  static List<String> getImagesPourCoran(int idCoran) {
    const Map<int, int> pagesParSection = {
      1: 9, 2: 8, 3: 8, 4: 8, 5: 8, 6: 8, 7: 8, 8: 8, 9: 8,
      10: 8, 11: 8, 12: 8, 13: 8, 14: 8, 15: 8, 16: 8, 17: 8, 18: 8,
      19: 8, 20: 8, 21: 8, 22: 8, 23: 8, 24: 8, 25: 8, 26: 8, 27: 8,
      28: 8, 29: 8, 30: 8, 31: 8, 32: 8, 33: 8, 34: 8, 35: 8, 36: 8,
      37: 8, 38: 8, 39: 8, 40: 8, 41: 8, 42: 8, 43: 8, 44: 8, 45: 8,
      46: 8, 47: 8, 48: 8, 49: 8, 50: 8, 51: 8, 52: 8, 53: 8, 54: 8,
      55: 8, 56: 8, 57: 8, 58: 8, 59: 8, 60: 10, 61: 10,
    };
    int? nombreDePages = pagesParSection[idCoran];
    if (nombreDePages != null) {
      return List.generate(nombreDePages, (index) => 'assets/images/quran${idCoran}_${index + 1}.jpg');
    }
    return [];
  }

  /// Retourne le texte du Duaa de ختم القرآن.
  static String getDuaa() {
    return "دعاء ختم القرآن الكريم\n\nبسم الله الرحمن الرحيم\n\nصدق الله العظيم وبلغ مولانا رسوله المصطفى النبي الكريم عليه أفضل الصلاة وأزكى التسليم وهو أصدق القائلين والمصدقين ،ونحن على ذلك من الشاهدين وبه مؤمنون ولا حول ولا قوة إلا بالله العلي العظيم ،\n\nورضي الله عن ساداتنا :أبي بكر وعمر وعثمان وعلي وطلحة والزبير وعبد الرحمن بن عوف وسعد وسعيد وعن أبي عبيدة ابن الجراح وحمزة والعباس وعن الحسن والحسين وعن جعفر وعقيل وفاطمة وخديجة وعائشة ورضي الله عن سائر أمهات المؤمنين وعن أصحاب رسول الله صلى الله عليه وسلم أجمعين وعن التابعين وتابعي التابعين لهم بإحسان إلى يوم الدين .\n\nاللهم اجعلنا يا مولانا من المحبين التابعين ،\n\nاللهم ارحمنا بالقرآن العظيم وبما فيه من الآيات والذكر الحكيم ،\n\nاللهم علمنا منه ما جهلنا وذكرنا منه ما نسينا وارزقنا تلاوته وحلاوته آناء الليل وأطراف النهار ابتغاء مرضاتك ياذا الجلال والإكرام.\n\nاللهم اجعله لنا إماما ونورا وهدى ورحمة.\n\nاللهم اجعل القرآن العظيم ربيع قلوبنا ، ونور به قلوبنا وقبورنا ،واشرح به صدورنا ويسر يه أمورنا ووفقنا به لما فيه رضاك عنا .\n\nاللهم اجعل القرآن العظيم شافعا مشفعا فينا ولا تجعله ماحلا مصدقا فينا ،\n\nاللهم اجعل القرآن العظيم أمامنا قائدنا إلى الجنة ولا تجعله خلفنا سائقنا إلى النار ،\n\nاللهم ارحمنا بالقرأن العظيم وارحم به والدينا وارحم به أشياخنا وارحم به أزواجنا وارحم به ذرياتنا وارحم به معاهدنا وارحم بها أصهارنا وأنصارنا وارحم بفضلك من علمنا وارحم به جميع المسلمين والمسلمات والمؤمنين والمؤمنات الأحياء منهم والأموات.\n\nاللهم اقسم لنا من خشيتك ما تحول به  بيننا وبين معاصيك ومن طاعتك ما تبلغنا به جنتك ومن اليقين ما تهون به علينا مصائب الدنيا ومتعنا بأبصارنا وأسماعنا وقوتنا ما أحييتنا، واجعله الوارث منا واجعل ثأرنا على من ظلمنا وانصرنا على من عادانا ولا تجعل مصيبتنا في ديننا ولا تجعل الدنيا أكبر همنا ولا مبلغ علمنا ولا غاية رغبتنا ولا تسلط علينا بذنوبنا من لا يرحمنا\n\nاللهم إنا نسألك من الخير كله عاجله وآجله ما علمنا منه وما لم نعلم ونعوذ بك من الشر كله عاجله وآجله ما علمنا منه وما لم نعلم ونسألك الجنة وما قرب إليها من قول وعمل، ونعوذ بك من النار وما قرب إليها من قول وعمل، ونسألك من كل خير سألك منه محمد نبيك وعبدك ورسولك صلى الله عليه وسلم ونعوذ بك من كل شر استعاذك منه محمد نبيك وعبدك ورسولك صلى الله عليه وسلم،\n\nاللهم ما قضيت به علينا من قضاء فاجعل عاقبته رشدا.\n\nياربنا ياخالق العوالم\nحل بيننا وبين كل ظالم\n\nياربنا أنت ترى ما قد جرى\nفاقصم بقهر من علينا جسرا\n\nياربنا عجل لنا بالفرج\nونجنا من ضيقة وحرج\n\nوامدد علينا من حماك الأمنع\nسرادقا من حل فيه يمنع\n\nاللهم احرسنا بعينك التي لا تنام ،واكنفنا في كنفك الذي لا يرام ،واجعلنا في جوارك الذي لا يخفر ولا يضام ،\n\nاللهم إنا ندرأ بك في نحور الأعداء ونعوذ بك من شرورهم،\n\nاللهم إنك أعلم بأعدائنا وكفى بك وليا وكفى بك نصيرا ، اللهم اكفناهم بما شئت .\n\nاللهم أصلح أمة سيدنا محمد صلى الله عليه وسلم .\n\nاللهم ارحم أمة سيدنا محمد صلى الله عليه وسلم.\n\n اللهم فرج عن أمة سيدنا محمد صلى الله عليه وسلم.\n\nاللهم لا تجعل لنا في وقتنا هذا ذنبا إلا غفرته ولا هما إلا فرجته ولا مريضا إلا شفيته  ولا عدوا إلا كفيته ولا دينا إلا قضيته ولامسافرا إلا حفظته وبلغته ولا قلبا إلا أصلحته ولا جائعا إلا أطعمته ولا عريانا إلا كسوته ولا بلاء إلا رددته وصرفته ولا ولا حاجة من حوائج الدنيا والآخرة لك فيه رضى ولنا فيها صلاح إلا أديتها وقضيتها برحمتك يا أرحم الراحمين.\n\nاللهم اغفر لحينا وميتنا وكبيرنا وصغيرنا وحاضرنا وغائبنا  وذكرنا وأنثانا وحرنا وعبدنا وطائعنا وعاصينا.\n\nاللهم اغفر لنا أجمعين وتوفنا مسلمين واحشرنا في زمرة النبيين والصديقين والشهداء والصالحين واكفنا ما أهمنا وما لم يهمنا من أمور الدين والدنيا والآخرة، وكف عنا أيدي المعتدين و لا تجعلنا فتنة للظالمين، ونجنا برحمتك من القوم الكافرين واجعلنا من عبادك المخلصين.\n\nواغفر لكل من إلينا أحسنا\nوجازه عنا الجزاء الأحسنا.\n\nواغفر لكل مسلم ومسلمه\nواحمل عن الجميع كل مظلمه\n\nواحفظ جيوش المسلمين وانصر\nولاتهم على ممر الأعصر.\n\nاللهم لا تجعل فينا ولا منا شقيا ولا محروما.\n\nاللهم استرنا بسترك الجميل وعاملنا بلطفك الجزيل وكن لنا صاحبا في المقام والرحيل.\n\n اللهم إنا نسألك الصدق في العبودية والقيام بحقوق الربوبية .\n\nاللهم إنا نسألك بفاتحية الفاتح الفتح التام وبخاتمية الخاتم حسن الختام،\n\n اللهم إنك أمرتنا بدعائك ووعدتنا بإجابتك وقد دعوناك كما أمرتنا فأجبنا كما وعدتنا يا ذا الجلال والإكرام، إنك لا تخلف الميعاد\n\n اللهم هذا الدعاء ومنك الإجابة وهذا الجهد منا وعليك التكلان، ولاحول ولا قوة إلا بالله العلي العظيم وصلى الله على سيدنا محمد وعلى آله وصحبه وسلم تسليما.\n\nسبحان ربك رب العزة عما يصفون وسلام على المرسلين والحمد لله رب العالمين.";
  }

  /// Retourne les informations sur la Khatma.
  static String getInfoKhatma() {
    return "\n* يمكنكم هذا التطبيق من :\n\n-\tقراءة أحزاب القرآن الكريم برواية ورش عن نافع (كل حزب مقسم إلى أثمان، وكل ثمن في صفحة) وهو ما يساعد على الحفظ، من خلال التطبيق يمكن الضغط على أي حزب لقراءته (المصحف المعتمد في التطبيق بعد سورة الفاتحة هو \"مصحف الشاذلي المثمن\" المشهور في الجزائر).\n\n-\tمعرفة الأحزاب التي تقرأ كل يوم حسب تاريخه، طبقا لبرنامج \"ختمة الإدارة\"، وهو ما يعين على مرافقة المواظبين على هذه الختمة وختم القرآن معهم كل ثلاثة أسابيع (من خلال الضغط على تواريخ الختمات القادمة في التطبيق، يمكن معرفة تواريخ ليالي الختمة).\n\n-\tمعرفة الأحزاب التي فيها مواضع سجود التلاوة ومعرفة أرقام الآيات للانتباه لها عند القراءة.\n\n-\tقراءة دعاء ختم القرآن الكريم.\n\n* ختمة الإدارة\n\n\" -الإدارة\"، من الدوران، لأنه يختم كل ثلاثة أسابيع  (من ليلة الخميس إلى ليلة الخميس) ... ، وهي من عمل أهل شنقيط وتتوارثها الأجيال في بعض المناطق الموريتانية ، حيث يواظب عليها في المساجد وفي البيوت.\n\n- تبدأ هذه الختمة ليلة الخميس ويختم القرآن ليلة الخميس الرابعة بعد البداية.\n\n- ثلاثة أحزاب في اليوم، حزب في الصباح وحزبين في المساء، إلا يوم الجمعة تقرأ سورة الكهف بدل الحزب الصباحي.\n";
  }

  /// Retourne la liste des Ahzab.
  static List<String> getListeAhzab() {
    return [
      "الحزب 1 : الم \nمن الفاتحة إلى الآية 75 من البقرة.",
      "الحزب 2 : وَإِذَا لَقُوا\nمن الآية 76 إلى الآية 141 من البقرة",
      "الحزب 3 : سَيَقُولُ السُّفَهَاء\n من الآية 142 إلى الآية 202 من البقرة",
      "الحزب 4 : وَاذْكُرُواْ اللّه\nمن الآية 203 إلى الآية 252 من البقرة",
      "الحزب 5 : تِلْكَ الرُّسُل\n من الآية 253من البقرة إلى الآية 14 من آل عمران",
      "الحزب 6 : قُلْ أَؤُنَبِّئُكُم \nمن الآية 15 إلى الآية 90 من آل عمران",
      "الحزب 7 : لَن تَنَالُواْ الْبِرَّ حَتَّى تُنفِقُواْ مِمَّا تُحِبُّون\nمن الآية 91 إلى الآية 170 من آل عمران",
      "الحزب 8 : يَسْتَبْشِرُون\n من الآية 171 من آل عمران إلى الآية 23 من النساء",
      "الحزب 9 : وَالْمُحْصَنَات\n من الآية 24 إلى الآية 85 من النساء",
      "الحزب 10 : اللّهُ لا إِلَـهَ إِلاَّ هُو\n من الآية 86 إلى الآية 146 من النساء",
      "الحزب 11 : لاَّ يُحِبُّ اللّهُ الْجَهْرَ بِالسُّوَءِ مِنَ الْقَوْل\n من الآية 147 من النساء إلى الآية 24 من المائدة",
      "الحزب 12 : قَالَ رَجُلاَن\n من الآية 25 إلى الآية 81 من المائدة",
      "الحزب 13 : لَتَجِدَن\nمن الآية 82 من المائدة إلى الآية 35 الأنعام",
      "الحزب 14 : إِنَّمَا يَسْتَجِيب \nمن الآية 36 إلى الآية 110 من الأنعام",
      "الحزب 15 : وَلَوْ أَنَّنَا\nمن الآية 111 من الأنعام إلى الآية 3 من الأعراف",
      "الحزب 16 : فَمَا كَانَ دَعْوَاهُم\nمن الآية 4 إلى الآية 87 من الأعراف",
      "الحزب 17 : قَالَ الْمَلأُ\nمن الآية 88 إلى الآية 170 من الأعراف",
      "الحزب 18 : وَإِذ نَتَقْنَا الْجَبَل\nمن الآية 171 من الأعراف إلى الآية 40 من الأنفال\nالسجدة، الآية 206 من الأعراف",
      "الحزب 19 : وَاعْلَمُواْ\n من الآية 41 من الأنفال إلى الآية 33 من التوبة",
      "الحزب 20 : يَا أَيُّهَا الَّذِينَ آمَنُواْ إِنَّ كَثِيرا\nمن الآية 34 إلى الآية 92 من التوبة",
      "الحزب 21 : إِنَّمَا السَّبِيل\nمن الآية 93 من التوبة إلى الآية 25 من يونس",
      "الحزب 22 : لِّلَّذِينَ أَحْسَنُواْ الحسنى\nمن الآية 26 من يونس إلى الآية 5 من هود",
      "الحزب 23 : وَمَا مِن دَآبَّة\nمن الآية 6 إلى الآية 83 من هود",
      "الحزب 24 : وَإِلَى مَدْيَن\nمن الآية 84 من هود إلى الآية 52 من يوسف",
      "الحزب 25 : وَمَا أُبَرِّىءُ\nمن الآية 53 من يوسف إلى الآية 18 من الرعد\nالسجدة، الآية 16 من الرعد",
      "الحزب 26 : أَفَمَن يَعْلَمُ\nمن الآية 19 من الرعد إلى آخر إبراهيم",
      "الحزب 27 : رُّبَمَا\nمن الآية 2 من الحجر إلى الآية 50 من النحل\nالسجدة، الآية 50 من النحل",
      "الحزب 28 : وَقَالَ اللّهُ\nمن الآية 51 إلى آخر النحل",
      "الحزب 29 : سُبْحَانَ\nمن الآية 1 إلى 98 من الإسراء",
      "الحزب 30 : أَوَلَمْ يَرَوْاْ\nمن 99 من الإسراء إلى الآية 74 من الكهف\nالسجدة، الآية 108 من الإسراء",
      "الحزب 31 : قَالَ أَلَمْ أَقُلْ لك\nمن الآية 75 من الكهف إلى الآية 8 من طه\nالسجدة، الآية 58 من مريم",
      "الحزب 32 : طه\nسورة طه",
      "الحزب 33 : اقْتَرَبَ لِلنَّاسِ حسابهم\nسورة الأنبياء",
      "الحزب 34 : يَا أَيُّهَا النَّاس\nسورة الحج\nالسجدة، الآية 18",
      "الحزب 35 : قَدْ أَفْلَح المؤمنون\nمن الآية 1 من المؤمنون إلى الآية 20 من النور",
      "الحزب 36 : يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَتَّبِعُوا خُطُوَاتِ الشَّيْطَان\nمن الآية 21 من النور إلى الآية 20 من الفرقان",
      "الحزب 37 : وَقَالَ الَّذِينَ لَا يَرْجُونَ\nمن الآية 21 الفرقان إلى الآية 110 من الشعراء\nالسجدة، الآية 60 من سورة الفرقان",
      "الحزب 38 : قَالُوا أَنُؤْمِنُ\nمن الآية 111 من الشعراء إلى الآية 55 من النمل\nالسجدة، الآية 26 من سورة النمل",
      "الحزب 39 : فَمَا كَانَ جَوَابَ\nمن الآية 56 من النمل إلى الآية 50 من القصص",
      "الحزب 40 : وَلَقَدْ وَصَّلْنَا\nمن الآية 51 من القصص إلى الآية 45 من العنكبوت",
      "الحزب 41 : وَلَا تُجَادِلُوا\nمن الآية 46 من العنكبوت إلى الآية 21 من لقمان",
      "الحزب 42 : وَمَن يُسْلِمْ\nمن الآية 22 من لقمان إلى الآية 30 من الأحزاب\nالسجدة، الآية 15 من سورة السجدة",
      "الحزب 43 : وَمَن يَقْنُتْ\nمن الآية 31 من الأحزاب إلى الآية 23 من سبا",
      "الحزب 44 : قُلْ مَن يَرْزُقُكُم\nمن الآية 24 من سبا إلى الآية 27 من يس",
      "الحزب 45 : وَمَا أَنزَلْنَا\nمن الآية 28 من يس إلى الآية 145 من الصافات",
      "الحزب 46 : * فَنَبَذْنَاه\nمن الآية 146 من الصافات إلى الآية 31 من الزمر\nالسجدة، الآية 23 من سورة ص",
      "الحزب 47 : فَمَنْ أَظْلَم\nمن الآية 32 من الزمر إلى الآية 40 من غافر",
      "الحزب 48 : وَيَا قَوْمِ\nمن الآية 41 من غافر إلى الآية 46 من فصلت\nالسجدة، الآية 37 من فصلت",
      "الحزب 49 : إلَيْهِ\nمن الآية 47 من فصلت إلى الآية 23 من الزخرف",
      "الحزب 50 : قَالَ أَوَلَوْ \nمن الآية 24 من الزخرف إلى آخر الجاثية",
      "الحزب 51 : حم\nمن الآية 1 من الأحقاف إلى الآية 17 الفتح",
      "الحزب 52 : لَقَدْ رَضِيَ اللَّهُ\nمن الآية 18 من الفتح إلى الآية 30 من الذاريات",
      "الحزب 53 : قَالَ فَمَا خَطْبُكُمْ\nمن الآية 31 من الذاريات إلى آخر القمر",
      "الحزب 54 : الرَّحْمَنُ\nمن الرحمن إلى الحديد",
      "الحزب 55 : قَدْ سَمِعَ الله\nمن المجادلة إلى الصف",
      "الحزب 56 : يُسَبِّحُ \nمن الجمعة إلى التحريم",
      "الحزب 57 : تبَارَكَ\nمن الملك إلى نوح",
      "الحزب 58 : قُلْ أُوحِيَ\nمن الجن إلى المرسلات",
      "الحزب 59 : عَمَّ \nمن النبأ إلى الطارق",
      "الحزب 60 : سَبِّحِ \n من الأعلى إلى الناس",
    ];
  }
}
