Repository: abib17Drame/mm
Catalog: lib/l10n/app_*.arb
Languages: ar, fr

source: Daily Khatma
ar: الختمة اليومية
fr: Khatma Quotidienne

source: Navigation Menu
ar: قائمة التنقل
fr: Menu de navigation

source: Hizb List
ar: قائمة الأحزاب
fr: Liste des Ahzab

# khatmaDates
source: Next Khatma Dates
ar: تواريخ الختمات القادمة
fr: Dates des prochaines Khatmas

# quranRecitation
source: Quran Completion Duaa
ar: دعاء ختم القرآن
fr: Duaa Khatm Al-Quran

# aboutKhatma
source: About the application
ar: عن التطبيق
fr: À propos de l'application

source: About Us
ar: عنا
fr: À propos de nous

# quranReadingTitle
source: Quran Reading (Section {id})
ar: قراءة القرآن (الجزء {id})
fr: Lecture du Coran (Section {id})

source: Next
ar: التالي
fr: Suivant

source: Previous
ar: السابق
fr: Précédent

source: Data not available.
ar: البيانات غير متوفرة.
fr: Données non disponibles.

source: Error
ar: خطأ
fr: Erreur

# noDates
source: No dates to display.
ar: لا تواريخ لعرضها.
fr: Aucune date à afficher.

source: Version
ar: الإصدار

# aboutAppText
source: This application is a Flutter reimplementation of the original Khatma App.
ar: هذا التطبيق هو إعادة تنفيذ لتطبيق ختمة الأصلي باستخدام فلاتر.
fr: Cette application est une réimplémentation en Flutter de l'application originale Khatma App.

# khatmaDateTitle
source: Khatma {index}
ar: ختمة {index}

# quranSectionError
source: Images for section {id} could not be loaded. Only images for section 1 are included in this example.
ar: تعذر تحميل الصور للجزء {id}. يتضمن هذا المثال الصور للجزء 1 فقط.
fr: Les images pour la section {id} n'ont pas pu être chargées. Seules les images pour la section 1 sont incluses dans cet exemple.

# unimplementedNavigation
source: Navigation for this section is not yet implemented.
ar: التنقل لهذا القسم لم يتم تنفيذه بعد.
fr: La navigation pour cette section n'est pas encore implémentée.

# quranSectionNotAvailable
source: Section {id} not available
ar: الجزء {id} غير متوفر
fr: Section {id} non disponible

# quranSectionInfo
source: This section of the Quran is not yet available in this version of the application.
ar: هذا الجزء من القرآن غير متوفر في هذه النسخة من التطبيق.
fr: Cette section du Coran n'est pas encore disponible dans cette version de l'application.

# goBack
source: Back
ar: رجوع
fr: Retour

source: Image not available
ar: الصورة غير متوفرة
fr: Image non disponible

source: Language
ar: اللغة
fr: Langue

# currentLanguage
source: English
ar: العربية
fr: Français

source: Page Navigation
ar: تنقل الصفحات
fr: Navigation des pages

# pageInfo
source: Page {current} of {total}
ar: الصفحة {current} من {total}
fr: Page {current} sur {total}

source: Hizb completed
ar: تم إكمال الحزب
fr: Hizb terminé

# hizbCompletionMessage
source: Congratulations! You have completed this hizb.
ar: تهانينا! لقد أكملت هذا الحزب.
fr: Félicitations ! Vous avez terminé ce hizb.

# continueToNextHizb
source: Do you want to continue to the next hizb?
ar: هل تريد المتابعة إلى الحزب التالي؟
fr: Voulez-vous continuer vers le hizb suivant ?

source: Hizb 60 completed
ar: تم إكمال الحزب 60
fr: Hizb 60 terminé

# hizb60CompletionMessage
source: Congratulations! You have completed the last hizb of the Quran.
ar: تهانينا! لقد أكملت آخر حزب من القرآن.
fr: Félicitations ! Vous avez terminé le dernier hizb du Coran.

# continueToDuaa
source: Do you want to continue to the Khatm Al-Quran Duaa?
ar: هل تريد المتابعة إلى دعاء ختم القرآن؟
fr: Voulez-vous continuer vers le Duaa de Khatm Al-Quran ?

source: Yes
ar: نعم
fr: Oui

source: No
ar: لا
fr: Non

# dayMarkedCompleted
source: Day marked as completed!
ar: تم تحديد اليوم كمكتمل!
fr: Journée marquée comme terminée !

source: Khatma completed
ar: تم إكمال الختمة
fr: Khatma terminée

# khatmaCompletionMessage
source: Congratulations! You have completed the complete Khatma.
ar: تهانينا! لقد أكملت الختمة الكاملة.
fr: Félicitations ! Vous avez terminé la Khatma complète.

# continueToNewKhatma
source: Do you want to start a new Khatma?
ar: هل تريد بدء ختمة جديدة؟
fr: Voulez-vous commencer une nouvelle Khatma ?

# aboutAppTitle
source: About this application
ar: عن هذا التطبيق
fr: À propos de cette application

# aboutAppDescription
source: Khatma Flutter is a modern application developed to facilitate daily Quran reading according to the traditional "ختمة الإدارة" (Administration Khatma) program.
ar: ختمة فلاتر هو تطبيق حديث تم تطويره لتسهيل القراءة اليومية للقرآن الكريم حسب البرنامج التقليدي "ختمة الإدارة".
fr: Khatma Flutter est une application moderne développée pour faciliter la lecture quotidienne du Coran selon le programme traditionnel "ختمة الإدارة" (Khatma de l'Administration).

# aboutAppObjectives
source: Application objectives
ar: أهداف التطبيق
fr: Objectifs de l'application

# aboutAppQuranReading
source: Quran Reading : Display Quran pages with zoom and smooth navigation
ar: قراءة القرآن : عرض صفحات القرآن مع التكبير والتنقل السلس
fr: Lecture du Coran : Afficher les pages du Coran avec zoom et navigation fluide

# aboutAppDailyTracking
source: Daily tracking : Automatically calculate hizb to read each day
ar: المتابعة اليومية : حساب الأحزاب التي يجب قراءتها كل يوم تلقائياً
fr: Suivi quotidien : Calculer automatiquement les hizb à lire chaque jour

# aboutAppTemporalNavigation
source: Temporal navigation : Allow navigation between past and future days
ar: التنقل الزمني : السماح بالتنقل بين الأيام الماضية والمستقبلية
fr: Navigation temporelle : Permettre de naviguer entre les jours passés et futurs

# aboutAppCompleteList
source: Complete list : Display all 60 hizb with their details
ar: القائمة الكاملة : عرض جميع الأحزاب الستين مع تفاصيلها
fr: Liste complète : Afficher tous les 60 hizb avec leurs détails

# aboutAppCompletionDuaa
source: Completion dua'a : Include the complete Khatm Al-Quran dua'a
ar: دعاء الختم : تضمين دعاء ختم القرآن الكريم الكامل
fr: Dua'a de fin : Inclure le dua'a complet de Khatm Al-Quran

# aboutAppKhatmaDates
source: Khatma dates : Calculate and display upcoming dates
ar: تواريخ الختمات : حساب وعرض التواريخ القادمة
fr: Dates des Khatmas : Calculer et afficher les prochaines dates

# aboutAppMultilingual
source: Multilingual features
ar: الميزات متعددة اللغات
fr: Fonctionnalités multilingues

# aboutAppMultilingualDesc
source: Complete support in French, Arabic and English
ar: دعم كامل بالفرنسية والعربية والإنجليزية
fr: Support complet en français, arabe et anglais

# aboutAppLanguageChange
source: Dynamic language switching
ar: تغيير اللغة ديناميكياً
fr: Changement dynamique de langue

# aboutAppInterfaceAdapted
source: Interface adapted to each culture
ar: واجهة متكيفة مع كل ثقافة
fr: Interface adaptée à chaque culture

# aboutAppPersonalization
source: Personalization
ar: التخصيص
fr: Personnalisation

# aboutAppLightDarkMode
source: Light and dark mode
ar: الوضع الفاتح والوضع المظلم
fr: Mode clair et mode sombre

# aboutAppAdaptiveThemes
source: Adaptive themes
ar: السمات المتكيفة
fr: Thèmes adaptatifs

# aboutAppModernInterface
source: Modern and intuitive interface
ar: واجهة حديثة وبديهية
fr: Interface moderne et intuitive

# aboutAppCompatibility
source: Compatibility
ar: التوافق
fr: Compatibilité

# aboutAppAndroid
source: Android (phones and tablets)
ar: أندرويد (الهواتف والأجهزة اللوحية)
fr: Android (téléphones et tablettes)

# aboutAppIOS
source: iOS (iPhone and iPad)
ar: آي أو إس (آيفون وآيباد)
fr: iOS (iPhone et iPad)

# aboutAppWindows
source: Windows (computers)
ar: ويندوز (أجهزة الكمبيوتر)
fr: Windows (ordinateurs)

# aboutAppMacOS
source: macOS (Mac)
ar: ماك أو إس (ماك)

# aboutAppLinux
source: Linux (computers)
ar: لينكس (أجهزة الكمبيوتر)
fr: Linux (ordinateurs)

# aboutAppTechnicalFeatures
source: Technical features
ar: الميزات التقنية
fr: Fonctionnalités techniques

# aboutAppSQLite
source: Local SQLite database
ar: قاعدة بيانات محلية SQLite
fr: Base de données locale SQLite

# aboutAppOfflineMode
source: Complete offline mode
ar: وضع عدم الاتصال الكامل
fr: Mode hors ligne complet

# aboutAppImageSharing
source: Image and document sharing
ar: مشاركة الصور والمستندات
fr: Partage d'images et de documents

# aboutAppPDFExport
source: PDF export of dua'a
ar: تصدير PDF للدعاء
fr: Export PDF du dua'a

# aboutAppAutoBackup
source: Automatic preference backup
ar: النسخ الاحتياطي التلقائي للتفضيلات
fr: Sauvegarde automatique des préférences

# aboutAppPerformance
source: Performance
ar: الأداء

# aboutAppFastLoading
source: Fast image loading
ar: تحميل سريع للصور
fr: Chargement rapide des images

# aboutAppSmoothNavigation
source: Smooth navigation
ar: تنقل سلس
fr: Navigation fluide

# aboutAppMemoryOptimization
source: Memory optimization
ar: تحسين الذاكرة
fr: Optimisation mémoire

# aboutAppResponsiveInterface
source: Responsive interface
ar: واجهة مستجيبة
fr: Interface réactive

# aboutAppDevelopment
source: Development
ar: التطوير
fr: Développement

# aboutAppFlutterFramework
source: Modern Flutter framework
ar: إطار عمل فلاتر الحديث
fr: Framework Flutter moderne

# aboutAppModularArchitecture
source: Modular architecture
ar: هندسة معيارية
fr: Architecture modulaire

# aboutAppMaintainableCode
source: Maintainable and extensible code
ar: كود قابل للصيانة والتوسيع
fr: Code maintenable et extensible

# aboutAppTestsDocumentation
source: Tests and documentation
ar: الاختبارات والتوثيق
fr: Tests et documentation

# aboutAppSupport
source: Support
ar: الدعم

# aboutAppIntuitiveInterface
source: Intuitive interface
ar: واجهة بديهية
fr: Interface intuitive

# aboutAppErrorHandling
source: Graceful error handling
ar: معالجة الأخطاء بأمان
fr: Gestion d'erreurs gracieuse

# aboutAppHelpMessages
source: Contextual help messages
ar: رسائل المساعدة السياقية
fr: Messages d'aide contextuels

# aboutAppRegularUpdates
source: Regular updates
ar: التحديثات المنتظمة
fr: Mises à jour régulières
